# TopBendLength Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionSigmaProfile..::..TopBendLength Property
StructuralSectionSigmaProfile Class See Also
---
Top Bend segment length.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public double TopBendLength { get; set; }
```

Visual Basic
---
```text
Public Property TopBendLength As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double TopBendLength {
	double get ();
	void set (double value);
}
```

# See Also
StructuralSectionSigmaProfile Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace